// jsx 파일은 대표적으로 화면에 출력하기 위해
// 실행하는 function의 이름과 파일명을 일치하는게 관례
// => 그래야 알아보기 쉬우니까

function App() {
    // return 문의 최상단 부모 태그(컴포넌트)는 무조건 1개만 있어야 함

    let a = "손호영"
    let b = 25;

    return <>
        {/* 자바스크립트를 실행한 결과물을 리턴에 포함시키겠다 => 값이 나와야 함*/}
        {/* 문은 불가능 함 => if문, for문, 함수 선언문, 변수 선언문, etc */}
        {/* 계산을 시켜서 변수에 저장하는 할당문도 불가능 */}
        <div>{a}님의 나이는 {b}이며, 내년에는 {b+1}살이 됩니다.</div>
        <div>{a}님은 {b > 20 ? "성인" : "아이"}입니다.</div>
        App</>
}

// 1-1. React의 렌더링 때 코드에 대한 계산
// 1-2. React의 렌더링 때 결과
//     <div> {a}님의 나이는 ...</div>
//     <div> {a}님은 {b > 20 ...</div>
// 2. React의 렌더링 결과가 브라우저에게 전달이 되어서 브라우저 렌더링 (실제 화면 구현) 됨

export default App;